Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-GP_DFP/1.1.66/edc/PIC32MK1024GPL100.PIC
      <edc:SFRDef edc:_addr="0x1F881730" edc:_begin="0x0" edc:_end="0xbc0" edc:_modsrc="DOS-03247_can_fd_upb_v2_pic32mk.Module" edc:_refcount="2" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="CFD2FIFOUA31" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuu" edc:name="CFD2FIFOUA31" edc:nzwidth="32" edc:por="xxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxx" edc:portals="CLR SET INV" ltx:memberofperipheral="CAN2">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="FIFOUA" edc:mask="0xffffffff" edc:name="FIFOUA" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F881740" edc:_begin="0x0" edc:_end="0xbc0" edc:_modsrc="DOS-03247_can_fd_upb_v2_pic32mk.Module" edc:_refcount="2" edc:access="n--nnnnnn--nnnnnn--nnnnnn--nnnnn" edc:cname="CFD2FLTCON0" edc:desc="" edc:impl="0x9f9f9f9f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="u--uuuuuu--uuuuuu--uuuuuu--uuuuu" edc:name="CFD2FLTCON0" edc:nzwidth="32" edc:por="x--xxxxxx--xxxxxx--xxxxxx--xxxxx" edc:portals="CLR SET INV" ltx:memberofperipheral="CAN2">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="F0BP" edc:mask="0x1f" edc:name="F0BP" edc:nzwidth="0x5"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="FLTEN0" edc:mask="0x1" edc:name="FLTEN0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="F1BP" edc:mask="0x1f" edc:name="F1BP" edc:nzwidth="0x5"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="FLTEN1" edc:mask="0x1" edc:name="FLTEN1" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="F2BP" edc:mask="0x1f" edc:name="F2BP" edc:nzwidth="0x5"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="FLTEN2" edc:mask="0x1" edc:name="FLTEN2" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="F3BP" edc:mask="0x1f" edc:name="F3BP" edc:nzwidth="0x5"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="FLTEN3" edc:mask="0x1" edc:name="FLTEN3" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F881750" edc:_begin="0x0" edc:_end="0xbc0" edc:_modsrc="DOS-03247_can_fd_upb_v2_pic32mk.Module" edc:_refcount="2" edc:access="n--nnnnnn--nnnnnn--nnnnnn--nnnnn" edc:cname="CFD2FLTCON1" edc:desc="" edc:impl="0x9f9f9f9f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="u--uuuuuu--uuuuuu--uuuuuu--uuuuu" edc:name="CFD2FLTCON1" edc:nzwidth="32" edc:por="x--xxxxxx--xxxxxx--xxxxxx--xxxxx" edc:portals="CLR SET INV" ltx:memberofperipheral="CAN2">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="F4BP" edc:mask="0x1f" edc:name="F4BP" edc:nzwidth="0x5"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="FLTEN4" edc:mask="0x1" edc:name="FLTEN4" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="F5BP" edc:mask="0x1f" edc:name="F5BP" edc:nzwidth="0x5"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="FLTEN5" edc:mask="0x1" edc:name="FLTEN5" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="F6BP" edc:mask="0x1f" edc:name="F6BP" edc:nzwidth="0x5"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="FLTEN6" edc:mask="0x1" edc:name="FLTEN6" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="F7BP" edc:mask="0x1f" edc:name="F7BP" edc:nzwidth="0x5"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="FLTEN7" edc:mask="0x1" edc:name="FLTEN7" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F881760" edc:_begin="0x0" edc:_end="0xbc0" edc:_modsrc="DOS-03247_can_fd_upb_v2_pic32mk.Module" edc:_refcount="2" edc:access="n--nnnnnn--nnnnnn--nnnnnn--nnnnn" edc:cname="CFD2FLTCON2" edc:desc="" edc:impl="0x9f9f9f9f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="u--uuuuuu--uuuuuu--uuuuuu--uuuuu" edc:name="CFD2FLTCON2" edc:nzwidth="32" edc:por="x--xxxxxx--xxxxxx--xxxxxx--xxxxx" edc:portals="CLR SET INV" ltx:memberofperipheral="CAN2">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="F8BP" edc:mask="0x1f" edc:name="F8BP" edc:nzwidth="0x5"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="FLTEN8" edc:mask="0x1" edc:name="FLTEN8" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="F9BP" edc:mask="0x1f" edc:name="F9BP" edc:nzwidth="0x5"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="FLTEN9" edc:mask="0x1" edc:name="FLTEN9" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="F10BP" edc:mask="0x1f" edc:name="F10BP" edc:nzwidth="0x5"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="FLTEN10" edc:mask="0x1" edc:name="FLTEN10" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="F11BP" edc:mask="0x1f" edc:name="F11BP" edc:nzwidth="0x5"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="FLTEN11" edc:mask="0x1" edc:name="FLTEN11" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F881770" edc:_begin="0x0" edc:_end="0xbc0" edc:_modsrc="DOS-03247_can_fd_upb_v2_pic32mk.Module" edc:_refcount="2" edc:access="n--nnnnnn--nnnnnn--nnnnnn--nnnnn" edc:cname="CFD2FLTCON3" edc:desc="" edc:impl="0x9f9f9f9f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="u--uuuuuu--uuuuuu--uuuuuu--uuuuu" edc:name="CFD2FLTCON3" edc:nzwidth="32" edc:por="x--xxxxxx--xxxxxx--xxxxxx--xxxxx" edc:portals="CLR SET INV" ltx:memberofperipheral="CAN2">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="F12BP" edc:mask="0x1f" edc:name="F12BP" edc:nzwidth="0x5"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="FLTEN12" edc:mask="0x1" edc:name="FLTEN12" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="F13BP" edc:mask="0x1f" edc:name="F13BP" edc:nzwidth="0x5"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="FLTEN13" edc:mask="0x1" edc:name="FLTEN13" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="F14BP" edc:mask="0x1f" edc:name="F14BP" edc:nzwidth="0x5"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="FLTEN14" edc:mask="0x1" edc:name="FLTEN14" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="F15BP" edc:mask="0x1f" edc:name="F15BP" edc:nzwidth="0x5"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="FLTEN15" edc:mask="0x1" edc:name="FLTEN15" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
