Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-GP_DFP/1.1.66/edc/PIC32MK1024GPL100.PIC
      <edc:SFRDef edc:_addr="0x1F884070" edc:_begin="0x0" edc:_end="0xbc0" edc:_modsrc="DOS-03247_can_fd_upb_v2_pic32mk.Module" edc:_refcount="3" edc:access="nnnnnnnn---nnnnnnnnnnnnn---nnnnn" edc:cname="CFD3INT" edc:desc="" edc:grp="CAN1" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000uuu000u000000000uuu000u0000" edc:name="CFD3INT" edc:nzwidth="0x20" edc:por="00000xxx000x000000000xxx000x0000" edc:portals="CLR SET INV" ltx:memberofperipheral="CAN3">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="TXIF" edc:desc="" edc:mask="0x1" edc:name="TXIF" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RXIF" edc:desc="" edc:mask="0x1" edc:name="RXIF" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TBCIF" edc:desc="" edc:mask="0x1" edc:name="TBCIF" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="MODIF" edc:desc="" edc:mask="0x1" edc:name="MODIF" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TEFIF" edc:mask="0x1" edc:name="TEFIF" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="ECCIF" edc:mask="0x1" edc:name="ECCIF" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SPICRCIF" edc:mask="0x1" edc:name="SPICRCIF" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TXATIF" edc:mask="0x1" edc:name="TXATIF" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RXOVIF" edc:desc="" edc:mask="0x1" edc:name="RXOVIF" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SERRIF" edc:desc="" edc:mask="0x1" edc:name="SERRIF" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CERRIF" edc:desc="" edc:mask="0x1" edc:name="CERRIF" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="WAKIF" edc:desc="" edc:mask="0x1" edc:name="WAKIF" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="IVMIF" edc:desc="" edc:mask="0x1" edc:name="IVMIF" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TXIE" edc:desc="" edc:mask="0x1" edc:name="TXIE" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RXIE" edc:desc="" edc:mask="0x1" edc:name="RXIE" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TBCIE" edc:desc="" edc:mask="0x1" edc:name="TBCIE" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="MODIE" edc:desc="" edc:mask="0x1" edc:name="MODIE" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TEFIE" edc:mask="0x1" edc:name="TEFIE" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="ECCIE" edc:mask="0x1" edc:name="ECCIE" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SPICRCIE" edc:mask="0x1" edc:name="SPICRCIE" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TXATIE" edc:mask="0x1" edc:name="TXATIE" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RXOVIE" edc:desc="" edc:mask="0x1" edc:name="RXOVIE" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SERRIE" edc:desc="" edc:mask="0x1" edc:name="SERRIE" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CERRIE" edc:desc="" edc:mask="0x1" edc:name="CERRIE" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="WAKIE" edc:desc="" edc:mask="0x1" edc:name="WAKIE" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="IVMIE" edc:desc="" edc:mask="0x1" edc:name="IVMIE" edc:nzwidth="0x1"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0x1" edc:name="w" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F884080" edc:_begin="0x0" edc:_end="0xbc0" edc:_modsrc="DOS-03247_can_fd_upb_v2_pic32mk.Module" edc:_refcount="3" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn-" edc:cname="CFD3RXIF" edc:desc="" edc:impl="0xfffffffe" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuuuuuuuuuuuuuuuuuuuuuuuuu-" edc:name="CFD3RXIF" edc:nzwidth="32" edc:por="xxxxxxxxxxxxxxxxxxxxxxxxxxxxxxx-" edc:portals="CLR SET INV" ltx:memberofperipheral="CAN3">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="RFIF" edc:mask="0x7fffffff" edc:name="RFIF" edc:nzwidth="0x1f"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F884090" edc:_begin="0x0" edc:_end="0xbc0" edc:_modsrc="DOS-03247_can_fd_upb_v2_pic32mk.Module" edc:_refcount="3" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="CFD3TXIF" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuu" edc:name="CFD3TXIF" edc:nzwidth="32" edc:por="xxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxx" edc:portals="CLR SET INV" ltx:memberofperipheral="CAN3">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="TFIF" edc:mask="0xffffffff" edc:name="TFIF" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F8840A0" edc:_begin="0x0" edc:_end="0xbc0" edc:_modsrc="DOS-03247_can_fd_upb_v2_pic32mk.Module" edc:_refcount="3" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn-" edc:cname="CFD3RXOVIF" edc:desc="" edc:impl="0xfffffffe" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuuuuuuuuuuuuuuuuuuuuuuuuu-" edc:name="CFD3RXOVIF" edc:nzwidth="32" edc:por="xxxxxxxxxxxxxxxxxxxxxxxxxxxxxxx-" edc:portals="CLR SET INV" ltx:memberofperipheral="CAN3">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="RFOVIF" edc:mask="0x7fffffff" edc:name="RFOVIF" edc:nzwidth="0x1f"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F8840B0" edc:_begin="0x0" edc:_end="0xbc0" edc:_modsrc="DOS-03247_can_fd_upb_v2_pic32mk.Module" edc:_refcount="3" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="CFD3TXATIF" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuu" edc:name="CFD3TXATIF" edc:nzwidth="32" edc:por="xxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxx" edc:portals="CLR SET INV" ltx:memberofperipheral="CAN3">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="TFATIF" edc:mask="0xffffffff" edc:name="TFATIF" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
